# RotateSubElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..RotateSubElement Method
Form Class See Also
---
Rotate a face/edge/curve/vertex of the form, by a specified angle around a given axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RotateSubElement(
	Reference subElementReference,
	Line axis,
	double angle
)
```

Visual Basic
---
```text
Public Sub RotateSubElement ( _
	subElementReference As Reference, _
	axis As Line, _
	angle As Double _
)
```

Visual C++
---
```text
public:
void RotateSubElement(
	Reference^ subElementReference,
	Line^ axis,
	double angle
)
```

# ### Parameters
subElementReference
    Type: Autodesk.Revit.DB..::..ReferenceThe geometry reference of face/edge/curve/vertex
axis
    Type: Autodesk.Revit.DB..::..LineAn unbounded line that represents the axis of rotation.
angle
    Type: System..::..DoubleThe angle, in radians, by which the element is to be rotated around the specified axis.
# See Also
Form Class
Autodesk.Revit.DB Namespace